//
//  NotificationModel.swift
//  OnJeWa
//
//  Created by Eojin Choi on 2023/05/14.
//

import Foundation

struct NotificationModel {
    
}

let normalNotificationMessages: [Int: String] = [
    2: "잘 지내고 이써? 나는 주이니 침대에서 땅꿀파는 중이댜~ 주인냄새 죠아!",
    6: "주이니 오려면 얼마 안남았네!! 밥은 먹어써??",
    10: "..주이나 보고시포",
    14: "기다리면서 잠깐 잠들었눈데..주이니가 없댜..",
    18: "오딧어..? 밖에 무서운 야옹이들이 울고이써..",
    22: "하루가 지나버렸네에....무슨일 있는곤 아니지? 걱정된댜아 언능와아"
]

let outgoingNotificationMessages: [Int: String] = [
    4: "주인! 내가 벌써 당근을 한개나 벌었어! 이따 미션같이 해줄꼬지? 빨리 집에 와서 함께해죠ㅎㅎ",
    8: "주인! 내가 벌써 당근을 두개나 벌었어! 이따 미션같이 해줄꼬지? 빨리 집에 와서 함께해죠ㅎㅎ",
    12: "주인! 내가 벌써 당근을 세개나 벌었어! 이따 미션같이 해줄꼬지? 빨리 집에 와서 함께해죠ㅎㅎ",
    16: "주인! 내가 벌써 당근을 네개나 벌었어! 이따 미션같이 해줄꼬지? 빨리 집에 와서 함께해죠ㅎㅎ",
    20: "주인! 내가 벌써 당근을 다섯개나 벌었어! 이따 미션같이 해줄꼬지? 빨리 집에 와서 함께해죠ㅎㅎ",
    24: "주인! 내가 벌써 당근을 여섯개나 벌었어! 이따 미션같이 해줄꼬지? 빨리 집에 와서 함께해죠ㅎㅎ"
]
